

export const russianDictionary = {
    'slide1Subtitle': 'Чемпионат Эстонии',
    'slide2Subtitle': 'Чемпионат Финляндии',
    'slide3Subtitle': 'Чемпионат Швеции',
    'title1': ["Путешествие по миру", "Кубика Рубика"],
    'subtitle1': ["Годы опыта и практики"],
     'section1Title': ['Начиная рано'],
    'section1Text': "Я рано начал свое путешествие по миру кубику Рубика, и с тех пор это стало определяющей частью моей жизни. Ранний старт позволил мне глубоко погрузиться в мир кубинга, отточить свои навыки и заложить прочный фундамент. Такое раннее начало не только подогрело мою страсть, но и придало мне уверенности в том, что я могу соревноваться, учить и делиться своей любовью к кубикам рубика с другими.",
    'section2Title': ['Посещая целый', 'Мир'],
    'section2Text':"Всего за 6 лет моей профессиональной карьеры в сборке кубика Рубика мне посчастливилось посетить более 35 соревнований по всему миру. Эти события привели меня в невероятные места, где я встретил удивительных людей и укрепил свою любовь к кубику рубика."
,
    'section3Title': ['Встречая новых людей'],
    'section3Text': "Благодаря кубику Рубику мне дозволилось повстречать невероятных людей из разных концов земли. Будь то соревнования или просто местные встречи, я заводил себе новых друзей и знакомых, которые изменили мою жизнь",
    'title2': ['Научись собирать' ,"Кубик Рубика"],
    'subtitle2': ["Профессиональные уроки"],
    'category1Title': ['Групповые занятия', 'для компаний'],
    'category2Title': ['Личные', 'Уроки'],
    '1hLesson': "Длительность урока: <strong>1ч</strong>",
    'anyDuration': "Длительность урока: <strong>1-3ч</strong>",
    "personOrOnline": "<strong>В живую</strong> или <strong>Онлайн</strong>",
    'inPerson': "<strong>В живую</strong>",
    '24hContact': "Связь со мной <strong>24/7</strong>",
    "personalFeedback": "Личный <strong>комментарий</strong>",
    "questions": "Личная <strong>поддержка</strong>",
    'teamBuilding': "Построение <strong>команды</strong>",
    'groupSize': "<strong>2-10</strong> человека в группе",
    'disclaimerPersonal': "Количество уроков зависит от вида кубика Рубика",
    'disclaimerTeam': "Количество уроков зависит от вида кубика Рубика и размера группы",
    'title3': ["Забронируйте урок с", "Проффесионалом"],
    "subtitle3": ["Забронируйте бесплатный 15-минутный урок чтоб спросить все интересующие вопросы и распланировать план обучения"],
    'title4': ["Свяжитесь со мной",'в любое время'],
    "subtitle4": ["Вы всегда можете связаться со мной чтоб спросить все нужные вопросы"],
    "email": "Емайл",
    "phone": "Номер телефона",
    'social': "Социальные сети",
    'about': "Обо мне",
    "cube": "Кубик Рубика",
    "privateLessons": "Индивидуальные уроки",
    "contact": "Контакт"
}
export const rusPageLink = () => {
    const url = new URL(window.location.href);
    url.searchParams.set('lang', 'rus');
    return url;
}